In [1]:
# mounting of Drive to import the Required Dataset

from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [15]:
# importing libraries numpy and pandas and random integer(randint) from random class

import pandas as pd
import numpy as np
from random import randint

In [41]:
# Creating the Given DataFrame

df = pd.DataFrame({'A': ['group1', 'group1', 'group2', 'group1','group2', 'group1', 'group2', 'group2','group2','group1'], 'B': ['true', 'true', 'false', 'false', 'false', 'false', 'false', 'true','false','true']})
df

        A      B
0  group1   true
1  group1   true
2  group2  false
3  group1  false
4  group2  false
5  group1  false
6  group2  false
7  group2   true
8  group2  false
9  group1   true

In [42]:
#printing DataFrame
print(df)

        A      B
0  group1   true
1  group1   true
2  group2  false
3  group1  false
4  group2  false
5  group1  false
6  group2  false
7  group2   true
8  group2  false
9  group1   true

In [17]:
# Grouping on the basis of Column A
for name, group in df.groupby('A'):
    print({name})

{'group1'}
{'group2'}

In [43]:
# Find those groups which have more “True” values than “False” values in the below dataframe:

df1 = df.groupby('A', axis = 0)['B'].describe()
df1.reset_index(inplace = True)
print(df1[df1.top == 'true']['A'])

0    group1
Name: A, dtype: object

In [44]:
# converting the series 1 and series 2 into set 1 and set 2

ser1 = pd.Series([1, 2, 3, 4, 5]) 
ser2 = pd.Series([4, 5, 6, 7, 8])
set1 = set(ser1)
set2 = set(ser2)

In [46]:
# Get the items not common to both series A and series B (Without using loops)

print(set1 - set2 | set2 - set1)

{1, 2, 3, 6, 7, 8}

In [47]:
# Get the items common to both series A and series B(Without using loops)

print(set1 & set2)

{4, 5}

In [53]:
# Generating  random series of length 10 

a = []
for i in range (10):
    a.append(randint(0,10))
print(a)

[7, 0, 3, 2, 3, 6, 0, 9, 1, 6]

In [54]:
# finding the positions of numbers that are multiples of 3 from the series

a = pd.Series(a)
res = a.index[a.apply((lambda x : x % 3 == 0))].tolist()
print(res)

[1, 2, 4, 5, 6, 7, 9]

In [55]:
# Compute the cumulative difference between the consecutive number for the same series(without using loops).

a=pd.Series([1,3,6,10,15,21,27,35])
pd.Series(a.diff().tolist())

0    NaN
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    6.0
7    8.0
dtype: float64

In [24]:
# importing Dataset

data = pd.read_csv('/content/drive/MyDrive/Grouby_Assignment_Data.csv')
data.head()

   Unnamed: 0  Unnamed: 0.1  ...   price quantity
0           0             0  ...  154.60       23
1           1             1  ...  299.00        1
2           2             2  ...  516.85       22
3           3             3  ...  232.90        4
4           4             4  ...   67.98        4

[5 rows x 11 columns]

In [25]:
# Find the Average price of project from each state

data.groupby('school_state')['price'].mean()

school_state
ak    337.510667
al    298.641397
ar    278.166613
az    252.355673
ca    323.282639
co    252.666940
ct    311.030415
dc    360.152267
de    234.136735
fl    297.499525
ga    308.207945
hi    365.838639
ia    284.773153
id    253.708874
il    284.538685
in    249.736221
ks    246.894763
ky    280.020031
la    358.954185
ma    328.623520
md    303.952794
me    274.640000
mi    299.793970
mn    249.289851
mo    276.094635
ms    306.512922
mt    278.000490
nc    254.037568
nd    256.985035
ne    286.515307
nh    330.994425
nj    336.891618
nm    297.836876
nv    283.005000
ny    335.973861
oh    271.301090
ok    264.163071
or    289.779098
pa    279.585613
ri    296.904035
sc    247.343586
sd    249.673433
tn    279.079419
tx    304.977799
ut    310.182139
va    267.539311
vt    289.467250
wa    283.266018
wi    301.433963
wv    258.633121
wy    307.638878
Name: price, dtype: float64

In [26]:
# Find the total number of projects previously posted by all the teachers belonging to each teacher prefix.

data.groupby('teacher_prefix')['teacher_number_of_previously_posted_projects'].count()

teacher_prefix
dr            13
mr         10645
mrs        57264
ms         38944
teacher     2360
Name: teacher_number_of_previously_posted_projects, dtype: int64

In [27]:
# Find the prefix of the teacher who has posted the maximum of projects previously
data.groupby('teacher_prefix')['teacher_number_of_previously_posted_projects'].max().sort_values(ascending = False).index[0]

'mrs'

In [28]:
# Sampling 10 Data Values

data.sample(10)

       Unnamed: 0  Unnamed: 0.1  ...    price quantity
43995       43995         44003  ...   499.99        1
51238       51238         51249  ...   280.50       34
20034       20034         20039  ...   263.78       33
59228       59228         59240  ...   664.30       22
52736       52736         52747  ...  1248.00        2
27529       27529         27534  ...   684.25        5
61373       61373         61385  ...   910.37       39
17833       17833         17838  ...    42.83       22
89417       89417         89436  ...   396.45        7
76689       76689         76707  ...   301.19        3

[10 rows x 11 columns]

In [29]:
# Find the number of projects approved for each project subject category belonging to the project grade category 'grade_9_12'

data[data['project_grade_category'] == 'grades_9_12'].groupby('project_subject_categories')['project_is_approved'].sum()

project_subject_categories
appliedlearning                        384
appliedlearning_health_sports           34
appliedlearning_history_civics          57
appliedlearning_literacy_language      191
appliedlearning_math_science           142
appliedlearning_music_arts             139
appliedlearning_specialneeds            99
appliedlearning_warmth_care_hunger       1
health_sports                          940
health_sports_appliedlearning            6
health_sports_history_civics             7
health_sports_literacy_language         10
health_sports_math_science               8
health_sports_music_arts                16
health_sports_specialneeds              54
health_sports_warmth_care_hunger         2
history_civics                         449
history_civics_appliedlearning           6
history_civics_health_sports             6
history_civics_literacy_language        92
history_civics_math_science             16
history_civics_music_arts               50
history_civics_specialneeds             54
literacy_language                     1769
literacy_language_appliedlearning       19
literacy_language_health_sports          8
literacy_language_history_civics        50
literacy_language_math_science          72
literacy_language_music_arts           153
literacy_language_specialneeds         220
math_science                          1999
math_science_appliedlearning           146
math_science_health_sports              46
math_science_history_civics             31
math_science_literacy_language          71
math_science_music_arts                139
math_science_specialneeds              177
math_science_warmth_care_hunger          1
music_arts                             962
music_arts_appliedlearning               1
music_arts_health_sports                 4
music_arts_history_civics                1
music_arts_specialneeds                 16
specialneeds                           309
specialneeds_health_sports              16
specialneeds_music_arts                 38
specialneeds_warmth_care_hunger          4
warmth_care_hunger                     166
Name: project_is_approved, dtype: int64

In [56]:
# Replace teacher_prefix with the average number of approved projects for each teacher prefix

sm = data.groupby('teacher_prefix')['project_is_approved'].mean()
d = dict(sm)
print(d)

{0.6923076923076923: 0.6923076923076923, 0.7953389830508475: 0.7953389830508475, 0.8415218412400188: 0.8415218412400188, 0.8435188989317995: 0.8435188989317995, 0.8555462419670299: 0.8555462419670299}

In [57]:
data['teacher_prefix'] = data['teacher_prefix'].map(d)
print(data)

        Unnamed: 0  Unnamed: 0.1  ...   price  quantity
0                0             0  ...  154.60        23
1                1             1  ...  299.00         1
2                2             2  ...  516.85        22
3                3             3  ...  232.90         4
4                4             4  ...   67.98         4
...            ...           ...  ...     ...       ...
109221      109221        109243  ...   59.98         8
109222      109222        109244  ...  846.32         4
109223      109223        109245  ...  239.96         4
109224      109224        109246  ...   73.05        16
109225      109225        109247  ...  109.90         5

[109226 rows x 11 columns]

In [64]:
# Creating the Required DataFrame

train_data = pd.DataFrame({'State': ['A', 'B', 'C', 'A','A', 'B', 'A', 'A','C','C'], 
                           'Class': [0, 1,1,0,1,1,0,1,1,0]})
print(train_data)

  State  Class
0     A      0
1     B      1
2     C      1
3     A      0
4     A      1
5     B      1
6     A      0
7     A      1
8     C      1
9     C      0

In [65]:
# Creating Immediate DataFrame for further Processing (Creating Class=0 and class=1 labels by grouping them on the basis of state and class values and finding their sum in the third label)

res = train_data[train_data['Class'] == 1].groupby('State')['Class'].count()
bes = train_data[train_data['Class'] == 0].groupby('State')['Class'].count()

da = pd.concat([res,bes], axis = 1)
da.columns = ['class = 1', 'class = 0']  
da = da.fillna(0)
da['sum'] = da['class = 1'] + da['class = 0']
print(da)

   class = 1  class = 0  sum
A          2        3.0  5.0
B          2        0.0  2.0
C          2        1.0  3.0

In [66]:
# Creating of repective needed DataFrame (Creating new Labels By dividing the values of class=0 and class=1 by their combined sum)

da['State_0']=da['class = 0'] / da['sum']
da['State_1']=da['class = 1'] / da['sum']
da.drop(['class = 1', 'class = 0', 'sum'], axis = 1, inplace = True)
print(da)

    State_0   State_1
A  0.600000  0.400000
B  0.000000  1.000000
C  0.333333  0.666667

In [62]:
# Creating Dictionary for State_0 and State_1 and mapping it to the original DataFrame to get the desired output Result

d=dict(da['State_0'])
e=dict(da['State_1'])

train_data['State_0'] = train_data['State'].map(d)
train_data['State_1'] = train_data['State'].map(e)

train_data.drop(['State', 'Class'], axis=1, inplace=True)

print(train_data)

    State_0   State_1
0  0.600000  0.400000
1  0.000000  1.000000
2  0.333333  0.666667
3  0.600000  0.400000
4  0.600000  0.400000
5  0.000000  1.000000
6  0.600000  0.400000
7  0.600000  0.400000
8  0.333333  0.666667
9  0.333333  0.666667